YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i3c.h
/***********************************************************************************************************************
    @file     reg_i3c.h
    @author   VV TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE SERIES OF
              MM32 FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_I3C_H
#define __REG_I3C_H

/* Files includes ------------------------------------------------------------*/
#include "core_starmc1.h"

#if 0
/* IP_DesignSpec_I3C_V0.2 */
#endif

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief I3C Base Address Definition
  */
#define I3C1_BASE                       (APB1PERIPH_BASE + 0xA000) /*!< Base Address: 0x4000A000 */

/**
  * @brief I3C Register Structure Definition
  */
typedef struct
{
    __IO uint32_t RESERVED0x00;        /*!< Reserved Register                  offset: 0x00 */
    __IO uint32_t CONFIG;              /*!< Configuration register             offset: 0x04 */
    __IO uint32_t STATUS;              /*!< Status register                    offset: 0x08 */
    __IO uint32_t CTRL;                /*!< Control register                   offset: 0x0C */
    __IO uint32_t INTSET;              /*!< Interrupt enable register          offset: 0x10 */
    __IO uint32_t INTCLR;              /*!< Clear interrupt-enable register    offset: 0x14 */
    __IO uint32_t INTMASKED;           /*!< Interrupt masked status register   offset: 0x18 */
    __IO uint32_t ERWAR;               /*!< Error and warning register         offset: 0x1C */
    __IO uint32_t DMACTRL;             /*!< DMA control register               offset: 0x20 */
    __IO uint32_t RESERVED0x24[2];     /*!< Reserved Register                  offset: 0x24~0x28 */
    __IO uint32_t DATACTRL;            /*!< Data control register              offset: 0x2C */
    __IO uint32_t WDATAB;              /*!< Write bytes register               offset: 0x30 */
    __IO uint32_t WDATABE;             /*!< Write the final byte register      offset: 0x34 */
    __IO uint32_t WDATAH;              /*!< Write a half-word register         offset: 0x38 */
    __IO uint32_t WDATAHE;             /*!< Write the final half-word register offset: 0x3C */
    __IO uint32_t RDATAB;              /*!< Read bytes register                offset: 0x40 */
    __IO uint32_t RESERVED0x44;        /*!< Reserved Register                  offset: 0x44 */
    __IO uint32_t RDATAH;              /*!< Read half-word register            offset: 0x48 */
    __IO uint32_t RESERVED0x4C[2];     /*!< Reserved Register                  offset: 0x4C~0x50 */
    __IO uint32_t WDATAB1;             /*!< Only write bytes register          offset: 0x54 */
    __IO uint32_t RESERVED0x58;        /*!< Reserved Register                  offset: 0x58 */
    __IO uint32_t CAPABILITIES2;       /*!< Functional information register2   offset: 0x5C */
    __IO uint32_t CAPABILITIES;        /*!< Functional information register    offset: 0x60 */
    __IO uint32_t DYNADDR;             /*!< Dynamic address register           offset: 0x64 */
    __IO uint32_t MAXLIMITS;           /*!< Max. limit register                offset: 0x68 */
    __IO uint32_t PARTNO;              /*!< Product model number id register   offset: 0x6C */
    __IO uint32_t IDEXT;               /*!< Id component register              offset: 0x70 */
    __IO uint32_t VENDORID;            /*!< Supplier id register               offset: 0x74 */
    __IO uint32_t RESERVED0x78[98];    /*!< Reserved Register                  offset: 0x78~0x1FC */
    __IO uint32_t DIV;                 /*!< Frequency division Register        offset: 0x200 */
    __IO uint32_t SPKLEN;              /*!< Filter register                    offset: 0x204 */
} I3C_TypeDef;

/**
  * @brief I3C type pointer Definition
  */
#define I3C1                                ((I3C_TypeDef *)I3C1_BASE)

/**
  * @brief I3C_CONFIG Register Bit Definition
  */
#define I3C_CONFIG_SLVENA_Pos               (0)
#define I3C_CONFIG_SLVENA_Msk               (0x01U << I3C_CONFIG_SLVENA_Pos)   /*!< I3C enable */
#define I3C_CONFIG_NACK_Pos                 (1)
#define I3C_CONFIG_NACK_Msk                 (0x01U << I3C_CONFIG_NACK_Pos)     /*!< Slave does not respond to all requests except the CCC broadcast */
#define I3C_CONFIG_MATSS_Pos                (2)
#define I3C_CONFIG_MATSS_Msk                (0x01U << I3C_CONFIG_MATSS_Pos)    /*!< The START and STOP state bits are setted only if the STATUS.MATCHED is setted */
#define I3C_CONFIG_S0IGNORE_Pos             (3)
#define I3C_CONFIG_S0IGNORE_Msk             (0x01U << I3C_CONFIG_S0IGNORE_Pos) /*!< The s0 or s1 errors are not detected */

#define I3C_CONFIG_IDRAND_Pos               (8)
#define I3C_CONFIG_IDRAND_Msk               (0x01U << I3C_CONFIG_IDRAND_Pos)   /*!< The bit 32 of the 48-bit PID indicates that the value of the partno register is random */
#define I3C_CONFIG_OFFLINE_Pos              (9)
#define I3C_CONFIG_OFFLINE_Msk              (0x01U << I3C_CONFIG_OFFLINE_Pos)  /*!< Rejoin the i3c bus with the existing dynamic address */

#define I3C_CONFIG_BAMAT_Pos                (16)
#define I3C_CONFIG_BAMAT_Msk                (0xFFU << I3C_CONFIG_BAMAT_Pos)    /*!< Configure count value */

#define I3C_CONFIG_SADDR_Pos                (25)
#define I3C_CONFIG_SADDR_Msk                (0x7FU << I3C_CONFIG_SADDR_Pos)    /*!< Set the i2c 7-bit static address */

/**
  * @brief I3C_STATUS Register Bit Definition
  */
#define I3C_STATUS_STNOTSTOP_Pos            (0)
#define I3C_STATUS_STNOTSTOP                (0x01U << I3C_STATUS_STNOTSTOP_Pos) /*!< I3C Bus busy (active), or this device detected s0 / s1 error waiting for HDR exit mode. */
#define I3C_STATUS_STMSG_Pos                (1)
#define I3C_STATUS_STMSG                    (0x01U << I3C_STATUS_STMSG_Pos)     /*!< Listening to or responding to the bus */
#define I3C_STATUS_STCCCH_Pos               (2)
#define I3C_STATUS_STCCCH                   (0x01U << I3C_STATUS_STCCCH_Pos)    /*!< Automating the ccc */
#define I3C_STATUS_STREQRD_Pos              (3)
#define I3C_STATUS_STREQRD                  (0x01U << I3C_STATUS_STREQRD_Pos)   /*!< The current bus request is an SDR mode read (bus reads the data from this device), or if the device is sending an IBI. */
#define I3C_STATUS_STREQWR_Pos              (4)
#define I3C_STATUS_STREQWR                  (0x01U << I3C_STATUS_STREQWR_Pos)   /*!< The bus is in ENTDAA mode (whether I3C has dynamic address or not) */
#define I3C_STATUS_STDAA_Pos                (5)
#define I3C_STATUS_STDAA                    (0x01U << I3C_STATUS_STDAA_Pos)     /*!< Target address for master mode */
#define I3C_STATUS_STHDR_Pos                (6)
#define I3C_STATUS_STHDR                    (0x01U << I3C_STATUS_STHDR_Pos)     /*!< The bus is in HDR mode */

