YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i3c.h
#define I3C_STATUS_START_Pos                (8)
#define I3C_STATUS_START                    (0x01U << I3C_STATUS_START_Pos)     /*!< The bus is detected to have a START or RESTART condition write 1 reset since the last time. */
#define I3C_STATUS_MATED_Pos                (9)
#define I3C_STATUS_MATED                    (0x01U << I3C_STATUS_MATED_Pos)     /*!< Since the last time the bit was cleared, the incoming address matches the I3C dynamic or I2C static address of this device. */
#define I3C_STATUS_STOP_Pos                 (10)
#define I3C_STATUS_STOP                     (0x01U << I3C_STATUS_STOP_Pos)      /*!< A STOP has been detected on the bus since the last time the bit was cleared (the STNOTSTOP bit indicates whether the bus is currently stopped). */
#define I3C_STATUS_RXPEND_Pos               (11)
#define I3C_STATUS_RXPEND                   (0x01U << I3C_STATUS_RXPEND_Pos)    /*!< Received data available */
#define I3C_STATUS_TXNF_Pos                 (12)
#define I3C_STATUS_TXNF                     (0x01U << I3C_STATUS_TXNF_Pos)      /*!< The TX FIFO can accept more data */
#define I3C_STATUS_DACHG_Pos                (13)
#define I3C_STATUS_DACHG                    (0x01U << I3C_STATUS_DACHG_Pos)     /*!< Dynamic addresses change when they are assigned, reassigned, or reset (lost). */
#define I3C_STATUS_CCC_Pos                  (14)
#define I3C_STATUS_CCC                      (0x01U << I3C_STATUS_CCC_Pos)       /*!< The I3C received from the device could not automatically process the CCC. */
#define I3C_STATUS_ERWAR_Pos                (15)
#define I3C_STATUS_ERWAR                    (0x01U << I3C_STATUS_ERWAR_Pos)     /*!< An error or warning has occurred; see the ERRWARN register for details */

#define I3C_STATUS_CHANDLED_Pos             (17)
#define I3C_STATUS_CHANDLED                 (0x01U << I3C_STATUS_CHANDLED_Pos)  /*!< The I3C slave device has handled the CCC */
#define I3C_STATUS_EVENT_Pos                (18)
#define I3C_STATUS_EVENT                    (0x01U << I3C_STATUS_EVENT_Pos)     /*!< An IBI, MR, or Hot-Join has been requested */

#define I3C_STATUS_EVDET_Pos                (20)
#define I3C_STATUS_EVDET_Msk                (0x03U << I3C_STATUS_EVDET_Pos)     /*!< Status of the current (EVENT is 1) or pending event */

#define I3C_STATUS_IBIDIS_Pos               (24)
#define I3C_STATUS_IBIDIS                   (0x01U << I3C_STATUS_IBIDIS_Pos)    /*!< The IBI is forbidden by the I3C bus controller via DISEC CCC */
#define I3C_STATUS_MRDIS_Pos                (25)
#define I3C_STATUS_MRDIS                    (0x01U << I3C_STATUS_MRDIS_Pos)     /*!< The bus controller request is forbidden by the I3C bus controller via DISEC CCC */

#define I3C_STATUS_HJDIS_Pos                (27)
#define I3C_STATUS_HJDIS                    (0x01U << I3C_STATUS_HJDIS_Pos)     /*!< Hot-Join is forbidden by the I3C bus controller via DISEC CCC */

#define I3C_STATUS_ACTSTATE_Pos             (28)
#define I3C_STATUS_ACTSTATE_Msk             (0x03U << I3C_STATUS_ACTSTATE_Pos)  /*!< The active state set by the I3C bus controller via ENTASn CCC */

/**
  * @brief I3C_CTRL Register Bit Definition
  */
#define I3C_CTRL_EVENT_Pos                  (0)
#define I3C_CTRL_EVENT_Msk                  (0x03U << I3C_CTRL_EVENT_Pos)    /*!< Setting it to a value other than 0 will request an event: */

#define I3C_CTRL_EXTDATA_Pos                (3)
#define I3C_CTRL_EXTDATA                    (0x01U << I3C_CTRL_EXTDATA_Pos)  /*!< After the IBI sends the IBIDATA, it continues to send extended data from the Tx FIFO. */

#define I3C_CTRL_IBIDATA_Pos                (8)
#define I3C_CTRL_IBIDATA_Msk                (0xFFU << I3C_CTRL_IBIDATA_Pos)  /*!< The IBI payload data bytes. */

#define I3C_CTRL_PENDINT_Pos                (16)
#define I3C_CTRL_PENDINT_Msk                (0x0FU << I3C_CTRL_PENDINT_Pos)  /*!< Configure the return value of the Pending Interrupt field of the GETSTATUS CCC command. */
#define I3C_CTRL_ACTSTATE_Pos               (20)
#define I3C_CTRL_ACTSTATE_Msk               (0x03U << I3C_CTRL_ACTSTATE_Pos) /*!< Configure the Activity state of the device as the return value of the Activity Mode field of the GETSTATUS CCC command. */

#define I3C_CTRL_VENDINFO_Pos               (24)
#define I3C_CTRL_VENDINFO_Msk               (0xFFU << I3C_CTRL_VENDINFO_Pos) /*!< The returned value of the Vendor Reserved field of the GETSTATUS CCC command is specified. */

/**
  * @brief I3C_INTSET Register Bit Definition
  */
#define I3C_INTSET_STIE_Pos                 (8)
#define I3C_INTSET_STIE                     (0x01U << I3C_INTSET_STIE_Pos)      /*!< Bus START/RESTART condition detected interrupt enabled */
#define I3C_INTSET_MATEDIE_Pos              (9)
#define I3C_INTSET_MATEDIE                  (0x01U << I3C_INTSET_MATEDIE_Pos)   /*!< Dynamic/static address matched interrupt enabled */
#define I3C_INTSET_SPIE_Pos                 (10)
#define I3C_INTSET_SPIE                     (0x01U << I3C_INTSET_SPIE_Pos)      /*!< Bus STOP condition detected interrupt enabled */
#define I3C_INTSET_RXPIE_Pos                (11)
#define I3C_INTSET_RXPIE                    (0x01U << I3C_INTSET_RXPIE_Pos)     /*!< Receive interrupt enabled */
#define I3C_INTSET_TXSIE_Pos                (12)
#define I3C_INTSET_TXSIE                    (0x01U << I3C_INTSET_TXSIE_Pos)     /*!< Transmit data (read) interrupt enabled */
#define I3C_INTSET_DACHGIE_Pos              (13)
#define I3C_INTSET_DACHGIE                  (0x01U << I3C_INTSET_DACHGIE_Pos)   /*!< Dynamic address changed interrupt enabled */
#define I3C_INTSET_CCCIE_Pos                (14)
#define I3C_INTSET_CCCIE                    (0x01U << I3C_INTSET_CCCIE_Pos)     /*!< CCC received interrupt enabled */
#define I3C_INTSET_ERWARIE_Pos              (15)
#define I3C_INTSET_ERWARIE                  (0x01U << I3C_INTSET_ERWARIE_Pos)   /*!< Error/Warning interrupt enabled */

#define I3C_INTSET_HANDLEDIE_Pos            (17)
#define I3C_INTSET_HANDLEDIE                (0x01U << I3C_INTSET_HANDLEDIE_Pos) /*!< CCC handled interrupt enabled */
#define I3C_INTSET_EVTIE_Pos                (18)
#define I3C_INTSET_EVTIE                    (0x01U << I3C_INTSET_EVTIE_Pos)     /*!< Event request (IBI or Hot-Join) interrupt enabled */

/**
  * @brief I3C_INTCLR Register Bit Definition
  */
#define I3C_INTCLR_STCLR_Pos                (8)
#define I3C_INTCLR_STCLR                    (0x01U << I3C_INTCLR_STCLR_Pos)      /*!< Clear START bit and disable the corresponding interrupt source */
#define I3C_INTCLR_MATEDCLR_Pos             (9)
#define I3C_INTCLR_MATEDCLR                 (0x01U << I3C_INTCLR_MATEDCLR_Pos)   /*!< Clear MATCHED bit and disable the corresponding interrupt source */
#define I3C_INTCLR_SPCLR_Pos                (10)
#define I3C_INTCLR_SPCLR                    (0x01U << I3C_INTCLR_SPCLR_Pos)      /*!< Clear STOP bit and disable the corresponding interrupt source */
#define I3C_INTCLR_RXPCLR_Pos               (11)
#define I3C_INTCLR_RXPCLR                   (0x01U << I3C_INTCLR_RXPCLR_Pos)     /*!< Clear RXPEND bit and disable the corresponding interrupt source */
#define I3C_INTCLR_TXSCLR_Pos               (12)
#define I3C_INTCLR_TXSCLR                   (0x01U << I3C_INTCLR_TXSCLR_Pos)     /*!< Clear TXSEND bit and disable the corresponding interrupt source */
#define I3C_INTCLR_DACHGCLR_Pos             (13)
#define I3C_INTCLR_DACHGCLR                 (0x01U << I3C_INTCLR_DACHGCLR_Pos)   /*!< Clear DACHG bit and disable the corresponding interrupt source */
#define I3C_INTCLR_CCCCLR_Pos               (14)
#define I3C_INTCLR_CCCCLR                   (0x01U << I3C_INTCLR_CCCCLR_Pos)     /*!< Clear CCC bit and disable the corresponding interrupt source */
#define I3C_INTCLR_ERWARCLR_Pos             (15)
#define I3C_INTCLR_ERWARCLR                 (0x01U << I3C_INTCLR_ERWARCLR_Pos)   /*!< Clear ERRWARN bit and disable the corresponding interrupt source */

#define I3C_INTCLR_HANDLEDCLR_Pos           (17)
#define I3C_INTCLR_HANDLEDCLR               (0x01U << I3C_INTCLR_HANDLEDCLR_Pos) /*!< Clear CHANDLED bit and disable the corresponding interrupt source */
#define I3C_INTCLR_EVTCLR_Pos               (18)
#define I3C_INTCLR_EVTCLR                   (0x01U << I3C_INTCLR_EVTCLR_Pos)     /*!< Clear EVENT bit and disable the corresponding interrupt source */

/**
  * @brief I3C_INTMASKED Register Bit Definition
  */
#define I3C_INTMASKED_STMSK_Pos             (8)
#define I3C_INTMASKED_STMSK                 (0x01U << I3C_INTMASKED_STMSK_Pos)      /*!< Bus START/RESTART condition detected flag */
#define I3C_INTMASKED_MATEDMSK_Pos          (9)
#define I3C_INTMASKED_MATEDMSK              (0x01U << I3C_INTMASKED_MATEDMSK_Pos)   /*!< Dynamic/static address matched interrupt flag */
#define I3C_INTMASKED_SPMSK_Pos             (10)
#define I3C_INTMASKED_SPMSK                 (0x01U << I3C_INTMASKED_SPMSK_Pos)      /*!< Bus STOP condition detected interrupt flag */
#define I3C_INTMASKED_RXPMSK_Pos            (11)
#define I3C_INTMASKED_RXPMSK                (0x01U << I3C_INTMASKED_RXPMSK_Pos)     /*!< Receive interrupt flag */
#define I3C_INTMASKED_TXSMSK_Pos            (12)
#define I3C_INTMASKED_TXSMSK                (0x01U << I3C_INTMASKED_TXSMSK_Pos)     /*!< Transmit data interrupt flag */
#define I3C_INTMASKED_DACHGMSK_Pos          (13)
#define I3C_INTMASKED_DACHGMSK              (0x01U << I3C_INTMASKED_DACHGMSK_Pos)   /*!< Dynamic address changed interrupt flag */
#define I3C_INTMASKED_CCCMSK_Pos            (14)
#define I3C_INTMASKED_CCCMSK                (0x01U << I3C_INTMASKED_CCCMSK_Pos)     /*!< CCC received interrupt flag */
#define I3C_INTMASKED_ERWARMSK_Pos          (15)
#define I3C_INTMASKED_ERWARMSK              (0x01U << I3C_INTMASKED_ERWARMSK_Pos)   /*!< Error/Warning interrupt flag */

#define I3C_INTMASKED_HANDLEDMSK_Pos        (17)
#define I3C_INTMASKED_HANDLEDMSK            (0x01U << I3C_INTMASKED_HANDLEDMSK_Pos) /*!< CHANDLED interrupt flag */
#define I3C_INTMASKED_EVTMSK_Pos            (18)
#define I3C_INTMASKED_EVTMSK                (0x01U << I3C_INTMASKED_EVTMSK_Pos)     /*!< Event request interrupt flag */

/**
  * @brief I3C_ERWAR Register Bit Definition
  */
#define I3C_ERWAR_ORUN_Pos                  (0)
#define I3C_ERWAR_ORUN                      (0x01U << I3C_ERWAR_ORUN_Pos)     /*!< The application failed to read the send data in time, resulting in a FIFO overflow */

#define I3C_ERWAR_URUN_Pos                  (1)
#define I3C_ERWAR_URUN                      (0x01U << I3C_ERWAR_URUN_Pos)     /*!< The application failed to provide send data in a timely manner, resulting in an underload of the FIFO */
#define I3C_ERWAR_URUNNACK_Pos              (2)
#define I3C_ERWAR_URUNNACK                  (0x01U << I3C_ERWAR_URUNNACK_Pos) /*!< The FIFO is underloaded when receiving the address of the read command, so the I3C slave device does not respond (NACK) to the address */
#define I3C_ERWAR_TERM_Pos                  (3)
#define I3C_ERWAR_TERM                      (0x01U << I3C_ERWAR_TERM_Pos)     /*!< The I3C bus controller terminates the read before the I3C sends data from the device to END */
#define I3C_ERWAR_INVST_Pos                 (4)
#define I3C_ERWAR_INVST                     (0x01U << I3C_ERWAR_INVST_Pos)    /*!< Invalid START condition occurs (SCL drops when SDA is high under STOP condition) */

#define I3C_ERWAR_SPAR_Pos                  (8)
#define I3C_ERWAR_SPAR                      (0x01U << I3C_ERWAR_SPAR_Pos)     /*!< The SDR message sent by the I3C controller has a parity error. Or the bus controller fails to drive the clock over 100us during SDR Read, resulting in read abort (timeout) */
#define I3C_ERWAR_S0S1_Pos                  (11)
#define I3C_ERWAR_S0S1                      (0x01U << I3C_ERWAR_S0S1_Pos)     /*!< An S0 or S1 error occurs, and the I3C is locked from the device, waiting for the HDR to exit the mode */

#define I3C_ERWAR_OREAD_Pos                 (16)
#define I3C_ERWAR_OREAD                     (0x01U << I3C_ERWAR_OREAD_Pos)    /*!< RDATAB and RDATAH registers are read in empty time */
#define I3C_ERWAR_OWRITE_Pos                (17)
#define I3C_ERWAR_OWRITE                    (0x01U << I3C_ERWAR_OWRITE_Pos)   /*!< Write data overflow: When full, the WDATAB/WDATABE and WDATAH/WDATAHE registers are written */

/**
  * @brief I3C_DMACTRL Register Bit Definition
  */
#define I3C_DMACTRL_DMAFB_Pos               (0)
#define I3C_DMACTRL_DMAFB_Msk               (0x03U << I3C_DMACTRL_DMAFB_Pos)  /*!< DMA read enable: */
#define I3C_DMACTRL_DMAFB_0                 (0x00U << I3C_DMACTRL_DMAFB_Pos)  /*!< DMA disable */
#define I3C_DMACTRL_DMAFB_1                 (0x01U << I3C_DMACTRL_DMAFB_Pos)  /*!< DMA is enabled for 1 frame messages and then automatically zeroed out when a STOP or START condition is detected */
#define I3C_DMACTRL_DMAFB_2                 (0x02U << I3C_DMACTRL_DMAFB_Pos)  /*!< DMA is enabled until this field is set to 0 */

#define I3C_DMACTRL_DMATB_Pos               (2)
#define I3C_DMACTRL_DMATB_Msk               (0x03U << I3C_DMACTRL_DMATB_Pos)  /*!< DMA write enable: */
#define I3C_DMACTRL_DMATB_0                 (0x00U << I3C_DMACTRL_DMATB_Pos)  /*!< DMA disable */
#define I3C_DMACTRL_DMATB_1                 (0x01U << I3C_DMACTRL_DMATB_Pos)  /*!< DMA is enabled for 1 frame messages and then automatically zeroed out when a STOP or START condition is detected */
#define I3C_DMACTRL_DMATB_2                 (0x02U << I3C_DMACTRL_DMATB_Pos)  /*!< DMA is enabled until this field is set to 0 */

#define I3C_DMACTRL_DMAWTH_Pos              (4)
#define I3C_DMACTRL_DMAWTH_Msk              (0x03U << I3C_DMACTRL_DMAWTH_Pos) /*!< Bit width of data transmitted by DMA: */
#define I3C_DMACTRL_DMAWTH_0                (0x00U << I3C_DMACTRL_DMAWTH_Pos) /*!< Byte (default) */
#define I3C_DMACTRL_DMAWTH_1                (0x01U << I3C_DMACTRL_DMAWTH_Pos) /*!< Byte (default) */
#define I3C_DMACTRL_DMAWTH_2                (0x02U << I3C_DMACTRL_DMAWTH_Pos) /*!< Half word (16 bits) */

/**
  * @brief I3C_DATACTRL Register Bit Definition
  */
#define I3C_DATACTRL_FLUSHTB_Pos            (0)
#define I3C_DATACTRL_FLUSHTB_Msk            (0x01U << I3C_DATACTRL_FLUSHTB_Pos) /*!< Refresh TX FIFO */
#define I3C_DATACTRL_FLUSHFB_Pos            (1)
#define I3C_DATACTRL_FLUSHFB_Msk            (0x01U << I3C_DATACTRL_FLUSHFB_Pos) /*!< Refresh RX FIFO */

#define I3C_DATACTRL_UNLOCK_Pos             (3)
#define I3C_DATACTRL_UNLOCK_Msk             (0x01U << I3C_DATACTRL_UNLOCK_Pos)  /*!< Write bits 7 to 4 are valid */
#define I3C_DATACTRL_TXTRIG_Pos             (4)
#define I3C_DATACTRL_TXTRIG_Msk             (0x03U << I3C_DATACTRL_TXTRIG_Pos)  /*!< TX FIFO trigger level: */
#define I3C_DATACTRL_TXTRIG_0               (0x00U << I3C_DATACTRL_TXTRIG_Pos)  /*!< Triggered when empty */
#define I3C_DATACTRL_TXTRIG_1               (0x01U << I3C_DATACTRL_TXTRIG_Pos)  /*!< Triggered when <= 1/4 full */
#define I3C_DATACTRL_TXTRIG_2               (0x02U << I3C_DATACTRL_TXTRIG_Pos)  /*!< Triggered when <= 1/2 full */
#define I3C_DATACTRL_TXTRIG_3               (0x03U << I3C_DATACTRL_TXTRIG_Pos)  /*!< Triggered when 1 or less than full */
#define I3C_DATACTRL_RXTRIG_Pos             (6)
#define I3C_DATACTRL_RXTRIG_Msk             (0x03U << I3C_DATACTRL_RXTRIG_Pos)  /*!< RX FIFO trigger level: */
#define I3C_DATACTRL_RXTRIG_0               (0x00U << I3C_DATACTRL_RXTRIG_Pos)  /*!< Triggered when empty */
#define I3C_DATACTRL_RXTRIG_1               (0x01U << I3C_DATACTRL_RXTRIG_Pos)  /*!< Triggered when >= 1/4 full */
#define I3C_DATACTRL_RXTRIG_2               (0x02U << I3C_DATACTRL_RXTRIG_Pos)  /*!< Triggered when >= 1/2 full */
#define I3C_DATACTRL_RXTRIG_3               (0x03U << I3C_DATACTRL_RXTRIG_Pos)  /*!< Triggered when >= 3/4 full */

#define I3C_DATACTRL_TXCNT_Pos              (16)
#define I3C_DATACTRL_TXCNT_Msk              (0x1FU << I3C_DATACTRL_TXCNT_Pos)   /*!< The number of bytes sent in the FIFO */

#define I3C_DATACTRL_RXCNT_Pos              (24)
#define I3C_DATACTRL_RXCNT_Msk              (0x1FU << I3C_DATACTRL_RXCNT_Pos)   /*!< The number of bytes received in the FIFO */

