YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i3c.h
#define I3C_DATACTRL_TXFULL_Pos             (30)
#define I3C_DATACTRL_TXFULL                 (0x01U << I3C_DATACTRL_TXFULL_Pos)  /*!< TX FIFO full/not full */

#define I3C_DATACTRL_RXEMPTY_Pos            (31)
#define I3C_DATACTRL_RXEMPTY                (0x01U << I3C_DATACTRL_RXEMPTY_Pos) /*!< RX FIFO empty/not empty */

/**
  * @brief I3C_WDATAB Register Bit Definition
  */
#define I3C_WDATAB_DATA_Pos                 (0)
#define I3C_WDATAB_DATA_Msk                 (0xFFU << I3C_WDATAB_DATA_Pos) /*!< Bytes of data sent to the bus controller */
#define I3C_WDATAB_END_Pos                  (8)
#define I3C_WDATAB_END                      (0x01U << I3C_WDATAB_END_Pos)  /*!< DATA is the final byte */

#define I3C_WDATAB_END2_Pos                 (16)
#define I3C_WDATAB_END2                     (0x01U << I3C_WDATAB_END2_Pos) /*!< DATA is the final byte 8 */

/**
  * @brief I3C_WDATABE Register Bit Definition
  */
#define I3C_WDATABE_DATA_Pos                (0)
#define I3C_WDATABE_DATA                    (0xFFU << I3C_WDATABE_DATA_Pos) /*!< The final data byte sent to the bus controller */

/**
  * @brief I3C_WDATAH Register Bit Definition
  */
#define I3C_WDATAH_DATA0_Pos                (0)
#define I3C_WDATAH_DATA0_Msk                (0xFFU << I3C_WDATAH_DATA0_Pos) /*!< The first byte of data sent to the bus controller */

#define I3C_WDATAH_DATA1_Pos                (8)
#define I3C_WDATAH_DATA1_Msk                (0xFFU << I3C_WDATAH_DATA1_Pos) /*!< The second byte of data sent to the bus controller */

#define I3C_WDATAH_END_Pos                  (16)
#define I3C_WDATAH_END                      (0x01U << I3C_WDATAH_END_Pos)   /*!< DATA1 is the final byte */

/**
  * @brief I3C_WDATAHE Register Bit Definition
  */
#define I3C_WDATAHE_DATA0_Pos               (0)
#define I3C_WDATAHE_DATA0_Msk               (0xFFU << I3C_WDATAHE_DATA0_Pos) /*!< The first byte of data sent to the bus controller */
#define I3C_WDATAHE_DATA1_Pos               (8)
#define I3C_WDATAHE_DATA1_Msk               (0xFFU << I3C_WDATAHE_DATA1_Pos) /*!< The second (and final) data byte sent to the bus controller */

/**
  * @brief I3C_RDATAB Register Bit Definition
  */
#define I3C_RDATAB_DATA0_Pos                (0)
#define I3C_RDATAB_DATA0_Msk                (0xFFU << I3C_RDATAB_DATA0_Pos) /*!< Read data bytes from the RX FIFO */

/**
  * @brief I3C_RDATAH Register Bit Definition
  */
#define I3C_RDATAH_LSB_Pos                  (0)
#define I3C_RDATAH_LSB_Msk                  (0xFFU << I3C_RDATAH_LSB_Pos) /*!< Read the first byte from the RX FIFO */
#define I3C_RDATAH_MSB_Pos                  (8)
#define I3C_RDATAH_MSB_Msk                  (0xFFU << I3C_RDATAH_MSB_Pos) /*!< Read the second byte from the RX FIFO */

/**
  * @brief I3C_WDATAB1 Register Bit Definition
  */
#define I3C_WDATAB1_DATA_Pos                (0)
#define I3C_WDATAB1_DATA                    (0xFFU << I3C_WDATAB1_DATA_Pos) /*!< Bytes sent to the bus controller */

/**
  * @brief I3C_CAPABILITIES2 Register Bit Definition
  */
#define I3C_CAPABILITIES2_MAPCNT_Pos        (0)
#define I3C_CAPABILITIES2_MAPCNT            (0x0FU << I3C_CAPABILITIES2_MAPCNT_Pos)   /*!< Indicates the number of supported address mappings */
#define I3C_CAPABILITIES2_I2C10B_Pos        (4)
#define I3C_CAPABILITIES2_I2C10B            (0x01U << I3C_CAPABILITIES2_I2C10B_Pos)   /*!< Supports I2C 10-bit addresses */
#define I3C_CAPABILITIES2_I2CRST_Pos        (5)
#define I3C_CAPABILITIES2_I2CRST            (0x01U << I3C_CAPABILITIES2_I2CRST_Pos)   /*!< Supports the reset of I2C applications */
#define I3C_CAPABILITIES2_I2CDEVID_Pos      (6)
#define I3C_CAPABILITIES2_I2CDEVID          (0x01U << I3C_CAPABILITIES2_I2CDEVID_Pos) /*!< Supports the I2C device ID */
#define I3C_CAPABILITIES2_IBIEXT_Pos        (8)
#define I3C_CAPABILITIES2_IBIEXT            (0x01U << I3C_CAPABILITIES2_IBIEXT_Pos)   /*!< supports IBI extended data */
#define I3C_CAPABILITIES2_IBIFIFO_Pos       (9)
#define I3C_CAPABILITIES2_IBIFIFO           (0x01U << I3C_CAPABILITIES2_IBIFIFO_Pos)  /*!< Support level 2 FIFO for IBI extended data */

#define I3C_CAPABILITIES2_V1P1_Pos          (16)
#define I3C_CAPABILITIES2_V1P1              (0x01U << I3C_CAPABILITIES2_V1P1_Pos)     /*!< Support GETCAPS CCC (I3C protocol v1.1) */
#define I3C_CAPABILITIES2_SLVRST_Pos        (17)
#define I3C_CAPABILITIES2_SLVRST            (0x01U << I3C_CAPABILITIES2_SLVRST_Pos)   /*!< Support reset from device (I3C protocol v1.1) */
#define I3C_CAPABILITIES2_GROUP_Pos         (18)
#define I3C_CAPABILITIES2_GROUP             (0x03U << I3C_CAPABILITIES2_GROUP_Pos)    /*!< Number of GROUP addresses supported */

#define I3C_CAPABILITIES2_AASA_Pos          (21)
#define I3C_CAPABILITIES2_AASA              (0x01U << I3C_CAPABILITIES2_AASA_Pos)     /*!< SETAASA is supported */
#define I3C_CAPABILITIES2_SSTSUB_Pos        (22)
#define I3C_CAPABILITIES2_SSTSUB            (0x01U << I3C_CAPABILITIES2_SSTSUB_Pos)   /*!< Support subscriber from device to device */
#define I3C_CAPABILITIES2_SSTWR_Pos         (23)
#define I3C_CAPABILITIES2_SSTWR             (0x01U << I3C_CAPABILITIES2_SSTWR_Pos)    /*!< Supports write from device to device */

/**
  * @brief I3C_CAPABILITIES Register Bit Definition
  */
#define I3C_CAPABILITIES_IDENA_Pos          (0)
#define I3C_CAPABILITIES_IDENA              (0x03U << I3C_CAPABILITIES_IDENA_Pos)     /*!< Processing method of 48-bit ID */
#define I3C_CAPABILITIES_IDREG_Pos          (2)
#define I3C_CAPABILITIES_IDREG              (0x0FU << I3C_CAPABILITIES_IDREG_Pos)     /*!< Select the register configuration ID information field */
#define I3C_CAPABILITIES_HDRSUPP_Pos        (6)
#define I3C_CAPABILITIES_HDRSUPP            (0x07U << I3C_CAPABILITIES_HDRSUPP_Pos)   /*!< Whether to support HDR and its type */
#define I3C_CAPABILITIES_MASTER_Pos         (9)
#define I3C_CAPABILITIES_MASTER             (0x01U << I3C_CAPABILITIES_MASTER_Pos)    /*!< Support the master function */
#define I3C_CAPABILITIES_SADDR_Pos          (10)
#define I3C_CAPABILITIES_SADDR              (0x03U << I3C_CAPABILITIES_SADDR_Pos)     /*!< Static address */

#define I3C_CAPABILITIES_CCCHANDLE_Pos      (12)
#define I3C_CAPABILITIES_CCCHANDLE          (0x0FU << I3C_CAPABILITIES_CCCHANDLE_Pos) /*!< Indicates that the CCC is handled by I3C from a device or by an application */

#define I3C_CAPABILITIES_IBIMRHJ_Pos        (16)
#define I3C_CAPABILITIES_IBIMRHJ            (0x1FU << I3C_CAPABILITIES_IBIMRHJ_Pos)   /*!< Supported event types: */
#define I3C_CAPABILITIES_TIMECTRL_Pos       (21)
#define I3C_CAPABILITIES_TIMECTRL           (0x01U << I3C_CAPABILITIES_TIMECTRL_Pos)  /*!< At least one time control mode is supported */
#define I3C_CAPABILITIES_EXTFIFO_Pos        (23)
#define I3C_CAPABILITIES_EXTFIFO            (0x07U << I3C_CAPABILITIES_EXTFIFO_Pos)   /*!< Supports external FIFO */
#define I3C_CAPABILITIES_FIFOTX_Pos         (26)
#define I3C_CAPABILITIES_FIFOTX             (0x03U << I3C_CAPABILITIES_FIFOTX_Pos)    /*!< Supports TX FIFO and its size */
#define I3C_CAPABILITIES_FIFORX_Pos         (28)
#define I3C_CAPABILITIES_FIFORX             (0x03U << I3C_CAPABILITIES_FIFORX_Pos)    /*!< Whether RX FIFO is supported and its size */

#define I3C_CAPABILITIES_INT_Pos            (30)
#define I3C_CAPABILITIES_INT                (0x01U << I3C_CAPABILITIES_INT_Pos)       /*!< Support interrupt */
#define I3C_CAPABILITIES_DMA_Pos            (31)
#define I3C_CAPABILITIES_DMA                (0x01U << I3C_CAPABILITIES_DMA_Pos)       /*!< Support DMA */

/**
  * @brief I3C_DYNADDR Register Bit Definition
  */
#define I3C_DYNADDR_DAVLD_Pos               (0)
#define I3C_DYNADDR_DAVLD                   (0x01U << I3C_DYNADDR_DAVLD_Pos)  /*!< A dynamic address was assigned when DADDR was read or set */
#define I3C_DYNADDR_DADDR_Pos               (1)
#define I3C_DYNADDR_DADDR_Msk               (0x7FU << I3C_DYNADDR_DADDR_Pos)  /*!< If DAVALID is 1, the field is the assigned dynamic address */
#define I3C_DYNADDR_DCAUSE_Pos              (8)
#define I3C_DYNADDR_DCAUSE                  (0x07U << I3C_DYNADDR_DCAUSE_Pos) /*!< Indicates the cause of the dynamic address change */

