YuZane/ExpressTrain/Device/MM32F5330/Include/reg_i3c.h
#define I3C_DYNADDR_KEY_Pos                 (16)
#define I3C_DYNADDR_KEY                     (0xFFFFU << I3C_DYNADDR_KEY_Pos)  /*!< Mapping Address Setting */

/**
  * @brief I3C_MAXLIMITS Register Bit Definition
  */
#define I3C_MAXLIMITS_MAXRD_Pos             (0)
#define I3C_MAXLIMITS_MAXRD_Msk             (0xFFFU << I3C_MAXLIMITS_MAXRD_Pos) /*!< Maximum number of bytes read. The value ranges from 16 to 4095 */
#define I3C_MAXLIMITS_MAXWR_Pos             (16)
#define I3C_MAXLIMITS_MAXWR_Msk             (0xFFFU << I3C_MAXLIMITS_MAXWR_Pos) /*!< Maximum number of bytes written. The value ranges from 8 to 4095 */

/**
  * @brief I3C_PARTNO Register Bit Definition
  */
#define I3C_PARTNO_Pos                      (0)
#define I3C_PARTNO_Msk                      (0xFFFFFFFFU << I3C_PARTNO_Pos) /*!< Set Part Number. 0 is usually invalid */

/**
  * @brief I3C_IDEXT Register Bit Definition
  */
#define I3C_IDEXT_DCR_Pos                   (8)
#define I3C_IDEXT_DCR_Msk                   (0xFFU << I3C_IDEXT_DCR_Pos) /*!< Configure DCR (Device type) */
#define I3C_IDEXT_BCR_Pos                   (16)
#define I3C_IDEXT_BCR_Msk                   (0xFFU << I3C_IDEXT_BCR_Pos) /*!< Configure BCR (bus capability) */

/**
  * @brief I3C_VENDORID Register Bit Definition
  */
#define I3C_VENDORID_VID_Pos                (0)
#define I3C_VENDORID_VID_Msk                (0x7FFFU << I3C_VENDORID_VID_Pos) /*!< Configure 15 bit MIPI Vendor ID */

/**
  * @brief I3C_DIV Register Bit Definition
  */
#define I3C_DIV_Pos                         (0)
#define I3C_DIV_Msk                         (0xFFU << I3C_DIV_Pos) /*!< CLK_SLOW Frequency division */

/**
  * @brief I3C_SPKLEN Register Bit Definition
  */
#define I3C_SPKLEN_SPKLEN_Pos               (0)
#define I3C_SPKLEN_SPKLEN_Msk               (0xFFU << I3C_SPKLEN_SPKLEN_Pos) /*!< Configure digital filter at the SCL and SDA inputs */

#define I3C_SPKLEN_FLT_EN_Pos               (16)
#define I3C_SPKLEN_FLT_EN                   (0x01U << I3C_SPKLEN_FLT_EN_Pos) /*!< Filter enable */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
